import { Component, OnInit } from "@angular/core";
import { Router } from "@angular/router";
import { NbIconLibraries } from "@nebular/theme";

@Component({
  selector: "ngx-home-page",
  templateUrl: "./home-page.component.html",
  styleUrls: ["./home-page.component.scss"],
})
export class HomePageComponent implements OnInit {
  benefits = [];
  constructor(iconsLibrary: NbIconLibraries, private router: Router) {
    iconsLibrary.registerFontPack("ion", { iconClassPrefix: "ion" });
  }

  goToAuth() {
    this.router.navigate(["/auth"]);
  }

  goToAbout() {
    this.router.navigate(["general/about"]);
  }

  ngOnInit(): void {
    this.benefits = [
      {
        title: "مهارت",
        text: "سازمان ها به صورت مداوم با نیاز به تغییر مواجه هستند . ممکن است این تغییرات به خاطر تغییر قانون ، تقاضای بازار یا ظهور شیوه های جدید کار باشد. یکی از ویژگی های کلیدی BPM این است که با توجه به فرآیند ، طراحی فرآیند می تواند انعطاف پذیر باشد. با استفاده از BPM شما می توانید با کم ترین هزینه تغییرات لازمه را برای یک فرآیند ایجاد کنید.شما می توانید متناسب با نیاز سازمان ،فرآیندها را ایجاد کنید.",
      },
      {
        title: "بهره وری و سودمندی",
        text: `با BPM شما میتوانید اتوماسیون بسیاری از عناصر تکراری را در گردش های منظم تسهیل کنید. با حذف تنگناها ، تعریف فرآیندهای موازی و حذف مراحل زائد در BPM شما می توانید فرآیندها را بهبود ببخشید.
        این بهبود بخشیدن ها به کارکنان اجازه خواهد داد تا زمان بیشتری را صرف فعالیت های دیگر بکنند تا زمانی که عملکرد های اصلی به کار گرفته شود. این به معنی بهره وری و کاهش اضافات است.`,
      },

      {
        title: " کارایی و کاهش خطرات",
        text: `دیدی که فرآیندهای تجاری به ما می دهد این امکان را به ما می دهد تا برروی ناکارآمدی ها در فرآیندها توجه کنیم. از آنجاییکه BPM به سازمان ها این فرصت را می دهد که به صورت کار آمد تری کار کنند ، سازمان ها می توانند منافع خود را بیشتر حفظ کنند. همچنین با طراحی یک BPM خوب طراحی شده می توانیم فرآیند را اجرا ، نظارت و خطر تقلب را کاهش دهیم.`,
      },
      {
        title: "رضایت کارکنان",
        text: `مدیریت فرایند کسب و کار خط قرمزهای زیادی را حذف می کند و به کارکنان اجازه می دهد تا به صورت صد در صدی بر روی کار خود تمرکز کنند تا اینکه اتوماسیون کارهای تکراری زیادی را حذف کند و دسترسی به اطلاعات را آسان تر کند . این به نوبه خود باعث افزایش بهره وری و نیروی کار شاد تر می شود.`,
      },
      {
        title: "تمرکز بر مشتری",
        text: `با فرآیندهای کم حجم و افزایش بهره وری کارمندان راحت تر می توانند بر روی مشتری تمرکز کنند . در اینجا نیاز به افزایش ظرفیت جهت پاسخگویی سریع تر به پیشنهادها وجود خواهد داشت هم چنین نیازمندی به ایجاد راه حل های سریع تر و همگام سازی سریع ترنیز احساس می شود.BPM همپنین با به هم پیوستن افراد و تکنولوژی در یک مسیر باعث افزایش رضایتمندی مشتری می شود.با BPM کارکنان قادر به تمرکز بر روی فعالیت هایی هستند که باعث ارائه نتایج مناسب تر برای مشتریان و سهامداران می شوند.`,
      },
      {
        title: "پایداری",
        text: `فرآیندهای کسب وکار به طور مستمر خود را با تغییرات سازمانی هماهنگ می کنند تا نتایج مورد انتظار را ارائه دهند . این هماهنگ سازی توسط BPM صورت می گیرد در زمانی که کنترل و یا نطارت مدیریتی انجام می شود.`,
      },
      {
        title: "اندازه گیری",
        text: `تمامی فرآیندها در پایان برای مقایسه می تواند مورد اندازه گیری قرار بگیرد. این کار باعث مدیریت بهتر فرآیندها و افراد می شود.
        زمانی که با تکنولوژی مورد استفاده قرار می گیرد شرایط گزارش و ابزارهای آنالیزی را برای تصمیم گیری های اجرایی فراهم می کند
        با BPMS شما می توانید فرآیندهای اجرایی و کمیت های آن و چگونگی کار فرآیندها در کمک کردن به سازمان ها برای بهینه سازی گردش کار را به دست آورید.`,
      },
      {
        title: "یکپارچه سازی فناوری",
        text: `BPM پل ارتباطی کاربران کسب و کار فناوری اطلاعات است، هدف از استفاده ی BPM تمرکز بر روی نرم افزار نیست بلکه بر روی فرآیندهایی می باشد که دارای برنامه های کاربردی هستند.`,
      },
    ];
  }
}
